---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooManySlopes
source: html/2af1e46b-780a-85a5-9c22-c9a8d1e01ac2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.TooManySlopes Property

There is more than one slope defined.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooManySlopes { get; }
```